zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_ltdc.c
  /* Specifies the constant alpha value */
  LTDC_LAYER(hltdc, LayerIdx)->CACR &= ~(LTDC_LxCACR_CONSTA);
  LTDC_LAYER(hltdc, LayerIdx)->CACR = (pLayerCfg->Alpha);

  /* Specifies the pixel format */
  switch (pLayerCfg->PixelFormat)
  {
    case LTDC_PIXEL_FORMAT_ARGB1555:
      PSIZE = 2U;
      ALEN = 1U;
      APOS = 15U;
      RLEN = 5U;
      RPOS = 10U;
      GLEN = 5U;
      GPOS = 5U;
      BLEN = 5U;
      BPOS = 0U;
      break;
    case LTDC_PIXEL_FORMAT_ARGB4444:
      PSIZE = 2U;
      ALEN = 4U;
      APOS = 12U;
      RLEN = 4U;
      RPOS = 8U;
      GLEN = 4U;
      GPOS = 4U;
      BLEN = 4U;
      BPOS = 0U;
      break;
    case LTDC_PIXEL_FORMAT_L8:
      PSIZE = 1U;
      ALEN = 0U;
      APOS = 0U;
      RLEN = 8U;
      RPOS = 0U;
      GLEN = 8U;
      GPOS = 0U;
      BLEN = 8U;
      BPOS = 0U;
      break;
    case LTDC_PIXEL_FORMAT_AL44:
      PSIZE = 1U;
      ALEN = 4U;
      APOS = 4U;
      RLEN = 4U;
      RPOS = 0U;
      GLEN = 4U;
      GPOS = 0U;
      BLEN = 4U;
      BPOS = 0U;
      break;
    case LTDC_PIXEL_FORMAT_AL88:
      PSIZE = 2U;
      ALEN = 8U;
      APOS = 8U;
      RLEN = 8U;
      RPOS = 0U;
      GLEN = 8U;
      GPOS = 0U;
      BLEN = 8U;
      BPOS = 0U;
      break;
    default :
      break;
  }

  switch (pLayerCfg->PixelFormat)
  {
    case LTDC_PIXEL_FORMAT_ARGB8888:
    case LTDC_PIXEL_FORMAT_ABGR8888:
    case LTDC_PIXEL_FORMAT_RGBA8888:
    case LTDC_PIXEL_FORMAT_BGRA8888:
    case LTDC_PIXEL_FORMAT_RGB565:
    case LTDC_PIXEL_FORMAT_BGR565:
    case LTDC_PIXEL_FORMAT_RGB888:
      LTDC_LAYER(hltdc, LayerIdx)->PFCR = (pLayerCfg->PixelFormat);
      LTDC_LAYER(hltdc, LayerIdx)->FPF0R = 0U;
      LTDC_LAYER(hltdc, LayerIdx)->FPF1R = 0U;
      break;
    case LTDC_PIXEL_FORMAT_ARGB1555:
    case LTDC_PIXEL_FORMAT_ARGB4444:
    case LTDC_PIXEL_FORMAT_L8:
    case LTDC_PIXEL_FORMAT_AL44:
    case LTDC_PIXEL_FORMAT_AL88:
      LTDC_LAYER(hltdc, LayerIdx)->PFCR = 0x7U;
      LTDC_LAYER(hltdc, LayerIdx)->FPF0R = (RLEN << 14U)  + (RPOS << 9U) + (ALEN << 5U) + APOS;
      LTDC_LAYER(hltdc, LayerIdx)->FPF1R = (PSIZE << 18U)  + (BLEN << 14U)  + (BPOS << 9U) + (GLEN << 5U) + GPOS;
      break;
    default :
      break;
  }

  switch (pLayerCfg->PixelFormat)
  {
    case LTDC_PIXEL_FORMAT_ARGB8888:
    case LTDC_PIXEL_FORMAT_ABGR8888:
    case LTDC_PIXEL_FORMAT_RGBA8888:
    case LTDC_PIXEL_FORMAT_BGRA8888:
      stride = 4U;
      break;
    case LTDC_PIXEL_FORMAT_RGB888:
      stride = 3U;
      break;
    case LTDC_PIXEL_FORMAT_RGB565:
    case LTDC_PIXEL_FORMAT_BGR565:
    case LTDC_PIXEL_FORMAT_ARGB1555:
    case LTDC_PIXEL_FORMAT_ARGB4444:
    case LTDC_PIXEL_FORMAT_AL88:
    case LTDC_PIXEL_FORMAT_UYVY:
    case LTDC_PIXEL_FORMAT_VYUY:
    case LTDC_PIXEL_FORMAT_YVYU:
    case LTDC_PIXEL_FORMAT_YUYV:
      stride = 2U;
      break;
    case LTDC_PIXEL_FORMAT_L8:
    case LTDC_PIXEL_FORMAT_AL44:
    default:
      stride = 1U;
      break;
  }

  /* Configure the frame buffer line number */
  LTDC_LAYER(hltdc, LayerIdx)->CFBLNR  &= ~(LTDC_LxCFBLNR_CFBLNBR);
  LTDC_LAYER(hltdc, LayerIdx)->CFBLNR  = (pLayerCfg->ImageHeight);

  /* set the pitch */
  LTDC_LAYER(hltdc, LayerIdx)->CFBLR  = ((((0x10000U - (pLayerCfg->ImageWidth * stride))) << 16U) |
                                         (((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) * stride)  + 7U));

  /* YUV configurations */
  if ((LTDC_LAYER(hltdc, LayerIdx)->C1R & (LTDC_LxC1R_YIA | LTDC_LxC1R_YSPA | LTDC_LxC1R_YFPA)) != 0U)
  {
    LTDC_LAYER(hltdc, LayerIdx)->PCR  &= ~(LTDC_LxPCR_VPDEN | LTDC_LxPCR_HPDEN | LTDC_LxPCR_YCEN | LTDC_LxPCR_YCM |
                                           LTDC_LxPCR_YF | LTDC_LxPCR_CBF | LTDC_LxPCR_YREN);
    switch (pLayerCfg->PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_UYVY:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | LTDC_LxPCR_CBF;
        break;
      case LTDC_PIXEL_FORMAT_VYUY:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN;
        break;
      case LTDC_PIXEL_FORMAT_YUYV:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | LTDC_LxPCR_YF | LTDC_LxPCR_CBF;
        break;
      case LTDC_PIXEL_FORMAT_YVYU:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | LTDC_LxPCR_YF;
        break;
      case LTDC_PIXEL_FORMAT_NV12:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | (0x1U << LTDC_LxPCR_YCM_Pos) | LTDC_LxPCR_CBF;
        break;
      case LTDC_PIXEL_FORMAT_NV21:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | (0x1U << LTDC_LxPCR_YCM_Pos);
        break;
      case LTDC_PIXEL_FORMAT_YUV420:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | (0x2U << LTDC_LxPCR_YCM_Pos) | LTDC_LxPCR_CBF;
        break;
      case LTDC_PIXEL_FORMAT_YVU420:
        LTDC_LAYER(hltdc, LayerIdx)->PCR  = LTDC_LxPCR_YCEN | (0x2U << LTDC_LxPCR_YCM_Pos);
        break;
      default :
        break;
    }
  }

  /* Specifies the blending factors */
  LTDC_LAYER(hltdc, LayerIdx)->BFCR &= ~(LTDC_LxBFCR_BOR | LTDC_LxBFCR_BF2 | LTDC_LxBFCR_BF1);
  tmp = ((uint32_t)(pLayerCfg->BlendingOrder) << 16U);
  LTDC_LAYER(hltdc, LayerIdx)->BFCR = (pLayerCfg->BlendingFactor1 | pLayerCfg->BlendingFactor2 | tmp);
  /* Configure the layer burst length configuration register */
  LTDC_LAYER(hltdc, LayerIdx)->BLCR  &= ~(LTDC_LxBLCR_BL);
  LTDC_LAYER(hltdc, LayerIdx)->BLCR  = (pLayerCfg->BurstLength);

  if ((LTDC_LAYER(hltdc, LayerIdx)->C1R & (LTDC_LxC1R_YIA | LTDC_LxC1R_YSPA | LTDC_LxC1R_YFPA)) != 0U)
  {
    /* Configure the conversion YCbCr RGB */
    LTDC_LAYER(hltdc, LayerIdx)->CYR0R &= ~(LTDC_LxCYR0R_CB2B | LTDC_LxCYR0R_CR2R);
    LTDC_LAYER(hltdc, LayerIdx)->CYR0R = 0x02040199U;

    /* Configure the conversion YCbCr RGB */
    LTDC_LAYER(hltdc, LayerIdx)->CYR1R &= ~(LTDC_LxCYR1R_CR2G | LTDC_LxCYR1R_CB2G);
    LTDC_LAYER(hltdc, LayerIdx)->CYR1R = 0x006400D0U;
  }

  if ((!pLayerCfg->HorMirrorEn) && (!pLayerCfg->VertMirrorEn))
  {
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = (pLayerCfg->FBStartAdress);

    switch (pLayerCfg->PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_NV12:
      case LTDC_PIXEL_FORMAT_NV21:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = (pLayerCfg->ImageWidth << 16U) |
                                             (pLayerCfg->WindowX1 - pLayerCfg->WindowX0 + 7U);
        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = (pLayerCfg->ImageHeight) >> 1U ;
        break;
      case LTDC_PIXEL_FORMAT_YUV420:
      case LTDC_PIXEL_FORMAT_YVU420:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = ((pLayerCfg->ImageWidth >> 1U) << 16U) |
                                             (((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U) + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = (pLayerCfg->ImageHeight) >> 1U;
        break;
      default :
        break;
    }

    /* Configure the color frame buffer pitch in byte */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR  &= ~(LTDC_LxCFBLR_CFBLL | LTDC_LxCFBLR_CFBP);
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR  = (((pLayerCfg->ImageWidth * stride) << 16U) |
                                           (((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) * stride)  + 7U));

    /* Enable LTDC_Layer by setting LEN bit */
    LTDC_LAYER(hltdc, LayerIdx)->CR = (uint32_t)LTDC_LxCR_LEN;
  }

  if ((pLayerCfg->HorMirrorEn) && (!pLayerCfg->VertMirrorEn))
  {
    /* Configure the color frame buffer start address */
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = pLayerCfg->FBStartAdress + \
                                         (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0)) - 1U;

    switch (pLayerCfg->PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_NV12:
      case LTDC_PIXEL_FORMAT_NV21:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0 + \
                                              (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0)) - 1U;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1 + \
                                              (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0)) - 1U;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = (pLayerCfg->ImageWidth << 16U) | \
                                             (pLayerCfg->WindowX1 - pLayerCfg->WindowX0 + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = pLayerCfg->ImageHeight >> 1U ;
        break;
      case LTDC_PIXEL_FORMAT_YUV420:
      case LTDC_PIXEL_FORMAT_YVU420:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0 + \
                                              (stride * ((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U)) - 1U;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1 + \
                                              (stride * ((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U)) - 1U;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = ((pLayerCfg->ImageWidth >> 1U) << 16U) | \
                                             (((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U) + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = pLayerCfg->ImageHeight >> 1U;
        break;
      default :
        break;
    }

    /* Configure the color frame buffer pitch in byte */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR  &= ~(LTDC_LxCFBLR_CFBLL | LTDC_LxCFBLR_CFBP);
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR  = (((pLayerCfg->ImageWidth * stride) << 16U) |
                                           (((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) * stride)  + 7U));

    /* Enable horizontal mirroring bit & LTDC_Layer by setting LEN bit */
    LTDC_LAYER(hltdc, LayerIdx)->CR = (uint32_t)LTDC_LxCR_HMEN | LTDC_LxCR_LEN;
  }

  if ((!pLayerCfg->HorMirrorEn) && (pLayerCfg->VertMirrorEn))
  {
    /* Configure the color frame buffer start address */
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = pLayerCfg->FBStartAdress + \
                                         (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0) * \
                                          ((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) - 1U));

    switch (pLayerCfg->PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_NV12:
      case LTDC_PIXEL_FORMAT_NV21:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0 + \
                                              (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0) * \
                                               (((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) >> 1U) - 1U));

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1 + \
                                              (stride * (pLayerCfg->WindowX1 - pLayerCfg->WindowX0) * \
                                               (((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) >> 1U) - 1U));

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = ((0x10000U - (pLayerCfg->ImageWidth * stride)) << 16U) |
                                             (((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) * stride)  + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = pLayerCfg->ImageHeight >> 1U;
        break;
      case LTDC_PIXEL_FORMAT_YUV420:
      case LTDC_PIXEL_FORMAT_YVU420:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R &= ~(LTDC_LxAFBA0R_AFBADD0);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = pLayerCfg->AuxiliaryFB.StartAddressBuffer0 +
                                              (stride * ((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U) *
                                               (((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) >> 1U) - 1U));

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R &= ~(LTDC_LxAFBA1R_AFBADD1);
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = pLayerCfg->AuxiliaryFB.StartAddressBuffer1 +
                                              (stride * ((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U) *
                                               (((pLayerCfg->WindowY1 - pLayerCfg->WindowY0) >> 1U) - 1U));

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR &= ~(LTDC_LxAFBLR_AFBLL | LTDC_LxAFBLR_AFBP);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = (((0x10000U - (pLayerCfg->ImageWidth >> 1U)) * stride) << 16U) |
                                             ((((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) >> 1U) * stride) + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_LxAFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = pLayerCfg->ImageHeight >> 1U;
        break;
      default :
        break;
    }

